witalis3/UA3REO-DDC-Transceiver/STM32/Src/peripheral.c
#include "stm32h7xx_hal.h"
#include "main.h"
#include "peripheral.h"
#include "lcd.h"
#include "trx_manager.h"
#include "agc.h"
#include "settings.h"
#include "system_menu.h"
#include "functions.h"
#include "audio_filters.h"

static bool PERIPH_SPI_busy = false;
static bool FRONTPanel_MCP3008_1_Enabled = true;
static bool FRONTPanel_MCP3008_2_Enabled = true;

static uint8_t ENCODER_ALast = 0;
static uint8_t ENCODER_AVal = 0;
static int32_t ENCODER_slowler = 0;
static uint8_t ENCODER2_ALast = 0;
static uint8_t ENCODER2_AVal = 0;
static uint8_t ENCODER2_AValDebFirst = 0;
static uint32_t ENCODER2_AValDeb = 0;
static bool ENCODER2_SWLast = true;

volatile PERIPH_FrontPanel_Type PERIPH_FrontPanel = {0};

static void PERIPH_ENCODER_Rotated(int8_t direction);
static void PERIPH_ENCODER2_Rotated(int8_t direction);
static uint16_t PERIPH_ReadMCP3008_Value(uint8_t channel, GPIO_TypeDef *CS_PORT, uint16_t CS_PIN);

void PERIPH_ENCODER_checkRotate(void)
{

	ENCODER_AVal = HAL_GPIO_ReadPin(ENC_CLK_GPIO_Port, ENC_CLK_Pin);
	if (ENCODER_ALast != ENCODER_AVal)
	{
		ENCODER_ALast = ENCODER_AVal;
		if (ENCODER_AVal != HAL_GPIO_ReadPin(ENC_DT_GPIO_Port, ENC_DT_Pin))
		{ // Если вывод A изменился первым - вращение по часовой стрелке
			ENCODER_slowler--;
			if (ENCODER_slowler < -TRX.ENCODER_SLOW_RATE)
			{
				PERIPH_ENCODER_Rotated(ENCODER_INVERT ? 1 : -1);
				ENCODER_slowler = 0;
			}
		}
		else
		{ // иначе B изменил свое состояние первым - вращение против часовой стрелки
			ENCODER_slowler++;
			if (ENCODER_slowler > TRX.ENCODER_SLOW_RATE)
			{
				PERIPH_ENCODER_Rotated(ENCODER_INVERT ? -1 : 1);
				ENCODER_slowler = 0;
			}
		}
	}
}

void PERIPH_ENCODER2_checkRotate(void)
{
	if((HAL_GetTick() - ENCODER2_AValDeb) < 20) return;
	ENCODER2_AValDebFirst = HAL_GPIO_ReadPin(ENC2_CLK_GPIO_Port, ENC2_CLK_Pin);
	HAL_Delay(1);
	ENCODER2_AVal = HAL_GPIO_ReadPin(ENC2_CLK_GPIO_Port, ENC2_CLK_Pin);
	if(ENCODER2_AValDebFirst != ENCODER2_AVal) return;
	if (ENCODER2_ALast != ENCODER2_AVal)
	{
		ENCODER2_ALast = ENCODER2_AVal;
		if (ENCODER2_AVal != HAL_GPIO_ReadPin(ENC2_DT_GPIO_Port, ENC2_DT_Pin))
		{ // Если вывод A изменился первым - вращение по часовой стрелке
			PERIPH_ENCODER2_Rotated(ENCODER2_INVERT ? 1 : -1);
		}
		else
		{ // иначе B изменил свое состояние первым - вращение против часовой стрелки
			PERIPH_ENCODER2_Rotated(ENCODER2_INVERT ? -1 : 1);
		}
		ENCODER2_AValDeb = HAL_GetTick();
	}
}

static void PERIPH_ENCODER_Rotated(int8_t direction) //энкодер повернули, здесь обработчик, direction -1 - влево, 1 - вправо
{
	TRX_Time_InActive = 0;
	if (TRX.Locked)
		return;

	if (LCD_systemMenuOpened && !LCD_timeMenuOpened)
	{
		eventRotateSystemMenu(direction);
		return;
	}
	if (!LCD_timeMenuOpened)
	{
		VFO *vfo = CurrentVFO();
		if (TRX.Fast)
		{
			TRX_setFrequency((uint32_t)((int32_t)vfo->Freq + 100 * direction), vfo);
			if ((vfo->Freq % 100) > 0)
				TRX_setFrequency(vfo->Freq / 100 * 100, vfo);
		}
		else
		{
			TRX_setFrequency((uint32_t)((int32_t)vfo->Freq + 10 * direction), vfo);
			if ((vfo->Freq % 10) > 0)
				TRX_setFrequency(vfo->Freq / 10 * 10, vfo);
		}
		LCD_UpdateQuery.FreqInfo = true;
	}
	if (LCD_timeMenuOpened)
	{
		uint32_t Time = RTC->TR;
		RTC_TimeTypeDef sTime;
		sTime.TimeFormat = RTC_HOURFORMAT12_PM;
		sTime.SubSeconds = 0;
		sTime.SecondFraction = 0;
		sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
		sTime.StoreOperation = RTC_STOREOPERATION_SET;
		sTime.Hours = (uint8_t)(((Time >> 20) & 0x03) * 10 + ((Time >> 16) & 0x0f));
		sTime.Minutes = (uint8_t)(((Time >> 12) & 0x07) * 10 + ((Time >> 8) & 0x0f));
		sTime.Seconds = (uint8_t)(((Time >> 4) & 0x07) * 10 + ((Time >> 0) & 0x0f));
		if (TimeMenuSelection == 0)
		{
			if (sTime.Hours == 0 && direction < 0)
				return;
			sTime.Hours = (uint8_t)(sTime.Hours + direction);
		}
		if (TimeMenuSelection == 1)
		{
			if (sTime.Minutes == 0 && direction < 0)
				return;
			sTime.Minutes = (uint8_t)(sTime.Minutes + direction);
		}
		if (TimeMenuSelection == 2)
		{
			if (sTime.Seconds == 0 && direction < 0)
				return;
			sTime.Seconds = (uint8_t)(sTime.Seconds + direction);
		}
		if (sTime.Hours >= 24)
			sTime.Hours = 0;
		if (sTime.Minutes >= 60)
			sTime.Minutes = 0;
		if (sTime.Seconds >= 60)
			sTime.Seconds = 0;
		HAL_RTC_DeInit(&hrtc);
		HAL_RTC_Init(&hrtc);
		HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
		LCD_UpdateQuery.SystemMenu = true;
		return;
	}
	NeedSaveSettings = true;
}

static void PERIPH_ENCODER2_Rotated(int8_t direction) //энкодер повернули, здесь обработчик, direction -1 - влево, 1 - вправо
{
	TRX_Time_InActive = 0;
	if (TRX.Locked)
		return;

	if (LCD_systemMenuOpened || LCD_timeMenuOpened)
	{
		eventSecRotateSystemMenu(direction);
		return;
	}

	//NOTCH - default action
	if (CurrentVFO()->NotchFilter)
	{
		if (CurrentVFO()->NotchFC > 50 && direction < 0)
			CurrentVFO()->NotchFC -= 25;
		else if (CurrentVFO()->NotchFC < CurrentVFO()->LPF_Filter_Width && direction > 0)
			CurrentVFO()->NotchFC += 25;
		LCD_UpdateQuery.StatusInfoGUI = true;
		NeedReinitNotch = true;
	}
	else
	{
		VFO *vfo = CurrentVFO();
		if (TRX.Fast)
		{
			TRX_setFrequency((uint32_t)((int32_t)vfo->Freq + 100000 * direction), vfo);
			if ((vfo->Freq % 100000) > 0)
				TRX_setFrequency(vfo->Freq / 100000 * 100000, vfo);
		}
		else
		{
			TRX_setFrequency((uint32_t)((int32_t)vfo->Freq + 25000 * direction), vfo);
			if ((vfo->Freq % 25000) > 0)
				TRX_setFrequency((uint32_t)((int32_t)vfo->Freq / 25000 * 25000), vfo);
		}
		LCD_UpdateQuery.FreqInfo = true;
	}
}

void PERIPH_ENCODER2_checkSwitch(void)
{
	if (TRX.Locked)
		return;

	bool ENCODER2_SWNow = HAL_GPIO_ReadPin(ENC2_SW_GPIO_Port, ENC2_SW_Pin);
	if (ENCODER2_SWLast != ENCODER2_SWNow)
	{
		ENCODER2_SWLast = ENCODER2_SWNow;
		if (!ENCODER2_SWNow)
		{
			TRX_Time_InActive = 0;
			if (CurrentVFO()->NotchFC > CurrentVFO()->LPF_Filter_Width)
				CurrentVFO()->NotchFC = CurrentVFO()->LPF_Filter_Width;
			if (!CurrentVFO()->NotchFilter)
				CurrentVFO()->NotchFilter = true;
			else
				CurrentVFO()->NotchFilter = false;

			NeedReinitNotch = true;
			LCD_UpdateQuery.StatusInfoGUI = true;
			LCD_UpdateQuery.TopButtons = true;
			NeedSaveSettings = true;
		}
	}
}

static uint8_t getBPFByFreq(uint32_t freq)
{
	if(freq >= CALIBRATE.BPF_0_START && freq < CALIBRATE.BPF_0_END) return 0;
	if(freq >= CALIBRATE.BPF_1_START && freq < CALIBRATE.BPF_1_END) return 1;
	if(freq >= CALIBRATE.BPF_2_START && freq < CALIBRATE.BPF_2_END) return 2;
	if(freq >= CALIBRATE.BPF_3_START && freq < CALIBRATE.BPF_3_END) return 3;
	if(freq >= CALIBRATE.BPF_4_START && freq < CALIBRATE.BPF_4_END) return 4;
	if(freq >= CALIBRATE.BPF_5_START && freq < CALIBRATE.BPF_5_END) return 5;
	if(freq >= CALIBRATE.BPF_6_START && freq < CALIBRATE.BPF_6_END) return 6;
	if(freq >= CALIBRATE.BPF_7_HPF) return 7;
	return 255;
}

