witalis3/UA3REO-DDC-Transceiver/STM32/Src/peripheral.c
void PERIPH_RF_UNIT_UpdateState(bool clean) //передаём значения в RF-UNIT
{
	bool hpf_lock = false;
	
	bool dualrx_lpf_disabled = false;
	bool dualrx_bpf_disabled = false;
	if((TRX.Dual_RX_Type != VFO_SEPARATE) && SecondaryVFO()->Freq > CALIBRATE.LPF_END)
		dualrx_lpf_disabled = true;
	if((TRX.Dual_RX_Type != VFO_SEPARATE) && getBPFByFreq(CurrentVFO()->Freq) != getBPFByFreq(SecondaryVFO()->Freq))
		dualrx_bpf_disabled = true;
	
	HAL_GPIO_WritePin(RFUNIT_RCLK_GPIO_Port, RFUNIT_RCLK_Pin, GPIO_PIN_RESET); //защёлка
	MINI_DELAY
	for (uint8_t registerNumber = 0; registerNumber < 24; registerNumber++)
	{
		HAL_GPIO_WritePin(RFUNIT_CLK_GPIO_Port, RFUNIT_CLK_Pin, GPIO_PIN_RESET); //клок данных
		MINI_DELAY
		HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_RESET); //данные
		MINI_DELAY
		if (!clean)
		{
			//REGISTER 1
			//if(registerNumber==0) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			if(registerNumber==1 && !TRX_on_TX() && TRX.LNA) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // LNA
			//if(registerNumber==2) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			//if(registerNumber==3) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			//if(registerNumber==4) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			//if(registerNumber==5) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			//if(registerNumber==6) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			if (registerNumber == 7 && TRX_on_TX() && CurrentVFO()->Mode != TRX_MODE_LOOPBACK)
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //TX_RX
			
			//REGISTER 2
			if (registerNumber == 8 && TRX_on_TX() && CurrentVFO()->Mode != TRX_MODE_LOOPBACK) //TX_AMP
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET);
			if (registerNumber == 9 && TRX.ATT) //ATT_ON
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET);
			if (registerNumber == 10 && (!TRX.LPF || CurrentVFO()->Freq > CALIBRATE.LPF_END || dualrx_lpf_disabled)) //LPF_OFF
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
			if (registerNumber == 11 && (!TRX.BPF || CurrentVFO()->Freq < CALIBRATE.BPF_1_START || dualrx_bpf_disabled)) //BPF_OFF
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
			if (registerNumber == 12 && TRX.BPF && getBPFByFreq(CurrentVFO()->Freq) == 0) //BPF_0
			{
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
				hpf_lock = true;														 //блокируем HPF для выделенного BPF фильтра УКВ
			}
			if (registerNumber == 13 && TRX.BPF && getBPFByFreq(CurrentVFO()->Freq) == 7 && !hpf_lock && !dualrx_bpf_disabled)
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //BPF_7_HPF
			if (registerNumber == 14 && TRX.BPF && getBPFByFreq(CurrentVFO()->Freq) == 6 && !dualrx_bpf_disabled)
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //BPF_6
			//if(registerNumber==15) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			
			//REGISTER 3
			//if(registerNumber==16) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			//if(registerNumber==17) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			if (registerNumber == 18 && ((TRX_on_TX() && CurrentVFO()->Mode != TRX_MODE_LOOPBACK) || TRX_Fan_Timeout > 0)) //FAN
			{
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
				if (TRX_Fan_Timeout > 0)
					TRX_Fan_Timeout--;
			}
			if (registerNumber == 19 && TRX.BPF && getBPFByFreq(CurrentVFO()->Freq) == 1 && !dualrx_bpf_disabled) //BPF_1
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
			if (registerNumber == 20 && TRX.BPF && getBPFByFreq(CurrentVFO()->Freq) == 2 && !dualrx_bpf_disabled) //BPF_2
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
			if (registerNumber == 21 && TRX.BPF && getBPFByFreq(CurrentVFO()->Freq) == 3 && !dualrx_bpf_disabled) //BPF_3
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
			if (registerNumber == 22 && TRX.BPF && getBPFByFreq(CurrentVFO()->Freq) == 4 && !dualrx_bpf_disabled) //BPF_4
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
			if (registerNumber == 23 && TRX.BPF && getBPFByFreq(CurrentVFO()->Freq) == 5 && !dualrx_bpf_disabled) //BPF_5
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); 
			
		}
		MINI_DELAY
		HAL_GPIO_WritePin(RFUNIT_CLK_GPIO_Port, RFUNIT_CLK_Pin, GPIO_PIN_SET);
	}
	MINI_DELAY
	HAL_GPIO_WritePin(RFUNIT_CLK_GPIO_Port, RFUNIT_CLK_Pin, GPIO_PIN_RESET);
	MINI_DELAY
	HAL_GPIO_WritePin(RFUNIT_RCLK_GPIO_Port, RFUNIT_RCLK_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(RFUNIT_OE_GPIO_Port, RFUNIT_OE_Pin, GPIO_PIN_RESET);
}

void PERIPH_InitFrontPanel(void)
{
	uint16_t test_value = PERIPH_ReadMCP3008_Value(0, AD1_CS_GPIO_Port, AD1_CS_Pin);
	if (test_value == 65535)
	{
		FRONTPanel_MCP3008_1_Enabled = false;
		sendToDebug_strln("[ERR] Frontpanel MCP3008 - 1 not found, disabling...");
		LCD_showError("MCP3008 - 1 init error", true);
	}
	test_value = PERIPH_ReadMCP3008_Value(0, AD2_CS_GPIO_Port, AD2_CS_Pin);
	if (test_value == 65535)
	{
		FRONTPanel_MCP3008_2_Enabled = false;
		sendToDebug_strln("[ERR] Frontpanel MCP3008 - 2 not found, disabling...");
		LCD_showError("MCP3008 - 1 init error", true);
	}
	PERIPH_ProcessFrontPanel();
	sendToDebug_strln("[OK] Frontpanel inited");
}

void PERIPH_ProcessFrontPanel(void)
{
	uint16_t mcp3008_value = 0;

	PERIPH_ENCODER2_checkSwitch();

	if (FRONTPanel_MCP3008_1_Enabled)
	{
		//MCP3008 - 1 (10bit - 1024values)
		mcp3008_value = PERIPH_ReadMCP3008_Value(0, AD1_CS_GPIO_Port, AD1_CS_Pin); // AB
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_ab = true;
		else
			PERIPH_FrontPanel.key_ab = false;

		mcp3008_value = PERIPH_ReadMCP3008_Value(1, AD1_CS_GPIO_Port, AD1_CS_Pin); // TUNE
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_tune = true;
		else
			PERIPH_FrontPanel.key_tune = false;

		mcp3008_value = PERIPH_ReadMCP3008_Value(2, AD1_CS_GPIO_Port, AD1_CS_Pin); // PREATT
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_preatt = true;
		else
			PERIPH_FrontPanel.key_preatt = false;

		mcp3008_value = PERIPH_ReadMCP3008_Value(3, AD1_CS_GPIO_Port, AD1_CS_Pin); // FAST
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_fast = true;
		else
			PERIPH_FrontPanel.key_fast = false;

		mcp3008_value = PERIPH_ReadMCP3008_Value(4, AD1_CS_GPIO_Port, AD1_CS_Pin); // MODE+
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_modep = true;
		else
			PERIPH_FrontPanel.key_modep = false;

		mcp3008_value = PERIPH_ReadMCP3008_Value(5, AD1_CS_GPIO_Port, AD1_CS_Pin); // MODE-
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_moden = true;
		else
			PERIPH_FrontPanel.key_moden = false;

		mcp3008_value = PERIPH_ReadMCP3008_Value(6, AD1_CS_GPIO_Port, AD1_CS_Pin); // BAND+
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_bandp = true;
		else
			PERIPH_FrontPanel.key_bandp = false;

		mcp3008_value = PERIPH_ReadMCP3008_Value(7, AD1_CS_GPIO_Port, AD1_CS_Pin); // BAND-
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_bandn = true;
		else
			PERIPH_FrontPanel.key_bandn = false;

		//A/B
		if (PERIPH_FrontPanel.key_ab_prev != PERIPH_FrontPanel.key_ab && PERIPH_FrontPanel.key_ab && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			PERIPH_FrontPanel.key_ab_starttime = HAL_GetTick();
			PERIPH_FrontPanel.key_ab_afterhold = false;
		}
		//A/B HOLD - DUAL RX SWITCH
		if (PERIPH_FrontPanel.key_ab_prev == PERIPH_FrontPanel.key_ab && PERIPH_FrontPanel.key_ab && (HAL_GetTick() - PERIPH_FrontPanel.key_ab_starttime) > KEY_HOLD_TIME && !PERIPH_FrontPanel.key_ab_afterhold && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			PERIPH_FrontPanel.key_ab_afterhold = true;
			if(TRX.Dual_RX_Type == VFO_SEPARATE)
				TRX.Dual_RX_Type = VFO_A_AND_B;
			else if(TRX.Dual_RX_Type == VFO_A_AND_B)
				TRX.Dual_RX_Type = VFO_A_PLUS_B;
			else if(TRX.Dual_RX_Type == VFO_A_PLUS_B)
				TRX.Dual_RX_Type = VFO_SEPARATE;
			LCD_UpdateQuery.TopButtons = true;
			ReinitAudioFilters();
		}
		//A/B CLICK
		if (PERIPH_FrontPanel.key_ab_prev != PERIPH_FrontPanel.key_ab && !PERIPH_FrontPanel.key_ab && (HAL_GetTick() - PERIPH_FrontPanel.key_ab_starttime) < KEY_HOLD_TIME && !PERIPH_FrontPanel.key_ab_afterhold && !TRX.Locked && !LCD_systemMenuOpened)
		{
			TRX_Time_InActive = 0;
			TRX.current_vfo = !TRX.current_vfo;
			TRX_setFrequency(CurrentVFO()->Freq, CurrentVFO());
			LCD_UpdateQuery.TopButtons = true;
			LCD_UpdateQuery.FreqInfo = true;
			LCD_UpdateQuery.StatusInfoGUI = true;
			NeedSaveSettings = true;
			ReinitAudioFilters();
			LCD_redraw();
		}
		//TUNE
		if (PERIPH_FrontPanel.key_tune_prev != PERIPH_FrontPanel.key_tune && PERIPH_FrontPanel.key_tune && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			TRX_Tune = !TRX_Tune;
			TRX_ptt_hard = TRX_Tune;
			LCD_UpdateQuery.StatusInfoGUI = true;
			LCD_UpdateQuery.TopButtons = true;
			NeedSaveSettings = true;
			TRX_Restart_Mode();
		}
		//PREATT
		if (PERIPH_FrontPanel.key_preatt_prev != PERIPH_FrontPanel.key_preatt && PERIPH_FrontPanel.key_preatt && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			PERIPH_FrontPanel.key_preatt_starttime = HAL_GetTick();
			PERIPH_FrontPanel.key_preatt_afterhold = false;
		}
		//PREATT HOLD - ADC DRIVER AND ADC PREAMP
		if (PERIPH_FrontPanel.key_preatt_prev == PERIPH_FrontPanel.key_preatt && PERIPH_FrontPanel.key_preatt && (HAL_GetTick() - PERIPH_FrontPanel.key_preatt_starttime) > KEY_HOLD_TIME && !PERIPH_FrontPanel.key_preatt_afterhold && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			PERIPH_FrontPanel.key_preatt_afterhold = true;

			if (!TRX.ADC_Driver && !TRX.ADC_PGA)
			{
				TRX.ADC_Driver = true;
				TRX.ADC_PGA = false;
			}
			else if (TRX.ADC_Driver && !TRX.ADC_PGA)
			{
				TRX.ADC_Driver = true;
				TRX.ADC_PGA = true;
			}
			else if (TRX.ADC_Driver && TRX.ADC_PGA)
			{
				TRX.ADC_Driver = false;
				TRX.ADC_PGA = true;
			}
			else if (!TRX.ADC_Driver && TRX.ADC_PGA)
			{
				TRX.ADC_Driver = false;
				TRX.ADC_PGA = false;
			}
			int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
			if(band>0)
			{
				TRX.BANDS_SAVED_SETTINGS[band].ADC_Driver = TRX.ADC_Driver;
				TRX.BANDS_SAVED_SETTINGS[band].ADC_PGA = TRX.ADC_PGA;
			}
			LCD_UpdateQuery.TopButtons = true;
			NeedSaveSettings = true;
		}
		//PREATT CLICK
		if (PERIPH_FrontPanel.key_preatt_prev != PERIPH_FrontPanel.key_preatt && !PERIPH_FrontPanel.key_preatt && (HAL_GetTick() - PERIPH_FrontPanel.key_preatt_starttime) < KEY_HOLD_TIME && !PERIPH_FrontPanel.key_preatt_afterhold && !TRX.Locked && !LCD_systemMenuOpened)
		{
			TRX_Time_InActive = 0;
			if (!TRX.LNA && !TRX.ATT)
			{
				TRX.LNA = true;
				TRX.ATT = false;
			}
			else if (TRX.LNA && !TRX.ATT)
			{
				TRX.LNA = true;
				TRX.ATT = true;
			}
			else if (TRX.LNA && TRX.ATT)
			{
				TRX.LNA = false;
				TRX.ATT = true;
			}
			else if (!TRX.LNA && TRX.ATT)
			{
				TRX.LNA = false;
				TRX.ATT = false;
			}
			int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
			if(band>0)
			{
				TRX.BANDS_SAVED_SETTINGS[band].LNA = TRX.LNA;
				TRX.BANDS_SAVED_SETTINGS[band].ATT = TRX.ATT;
			}
			LCD_UpdateQuery.TopButtons = true;
			NeedSaveSettings = true;
		}
		//FAST
		if (PERIPH_FrontPanel.key_fast_prev != PERIPH_FrontPanel.key_fast && PERIPH_FrontPanel.key_fast && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			TRX.Fast = !TRX.Fast;
			LCD_UpdateQuery.TopButtons = true;
			NeedSaveSettings = true;
		}
		//MODE+
		if (PERIPH_FrontPanel.key_modep_prev != PERIPH_FrontPanel.key_modep && PERIPH_FrontPanel.key_modep && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			int8_t mode = (int8_t)CurrentVFO()->Mode;
			mode++;
			if (mode < 0)
				mode = TRX_MODE_COUNT - 2;
			if (mode >= (TRX_MODE_COUNT - 1))
				mode = 0;
			TRX_setMode((uint8_t)mode, CurrentVFO());
			int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
			if(band>0)
				TRX.BANDS_SAVED_SETTINGS[band].Mode = (uint8_t)mode;
			LCD_UpdateQuery.TopButtons = true;
		}
		//MODE-
		if (PERIPH_FrontPanel.key_moden_prev != PERIPH_FrontPanel.key_moden && PERIPH_FrontPanel.key_moden && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			int8_t mode = (int8_t)CurrentVFO()->Mode;
			mode--;
			if (mode < 0)
				mode = TRX_MODE_COUNT - 2;
			if (mode >= (TRX_MODE_COUNT - 1))
				mode = 0;
			TRX_setMode((uint8_t)mode, CurrentVFO());
			int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
			if(band>0)
				TRX.BANDS_SAVED_SETTINGS[band].Mode = (uint8_t)mode;
			LCD_UpdateQuery.TopButtons = true;
		}
		//BAND+
		if (PERIPH_FrontPanel.key_bandp_prev != PERIPH_FrontPanel.key_bandp && PERIPH_FrontPanel.key_bandp && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
			band++;
			if (band >= BANDS_COUNT)
				band = 0;
			if (band < 0)
				band = BANDS_COUNT - 1;
			if (band >= 0)
			{
				TRX_setFrequency(TRX.BANDS_SAVED_SETTINGS[band].Freq, CurrentVFO());
				TRX_setMode(TRX.BANDS_SAVED_SETTINGS[band].Mode,CurrentVFO());
				TRX.LNA = TRX.BANDS_SAVED_SETTINGS[band].LNA;
				TRX.ATT = TRX.BANDS_SAVED_SETTINGS[band].ATT;
				TRX.ADC_Driver = TRX.BANDS_SAVED_SETTINGS[band].ADC_Driver;
				TRX.FM_SQL_threshold = TRX.BANDS_SAVED_SETTINGS[band].FM_SQL_threshold;
				TRX.ADC_PGA = TRX.BANDS_SAVED_SETTINGS[band].ADC_PGA;
				CurrentVFO()->DNR = TRX.BANDS_SAVED_SETTINGS[band].DNR;
				CurrentVFO()->AGC = TRX.BANDS_SAVED_SETTINGS[band].AGC;
			}
			LCD_UpdateQuery.TopButtons = true;
			LCD_UpdateQuery.FreqInfo = true;
		}
		//BAND-
		if (PERIPH_FrontPanel.key_bandn_prev != PERIPH_FrontPanel.key_bandn && PERIPH_FrontPanel.key_bandn && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
			band--;
			if (band >= BANDS_COUNT)
				band = 0;
			if (band < 0)
				band = BANDS_COUNT - 1;
			if (band >= 0)
			{
				TRX_setFrequency(TRX.BANDS_SAVED_SETTINGS[band].Freq, CurrentVFO());
				TRX_setMode(TRX.BANDS_SAVED_SETTINGS[band].Mode,CurrentVFO());
				TRX.LNA = TRX.BANDS_SAVED_SETTINGS[band].LNA;
				TRX.ATT = TRX.BANDS_SAVED_SETTINGS[band].ATT;
				TRX.ADC_Driver = TRX.BANDS_SAVED_SETTINGS[band].ADC_Driver;
				TRX.FM_SQL_threshold = TRX.BANDS_SAVED_SETTINGS[band].FM_SQL_threshold;
				TRX.ADC_PGA = TRX.BANDS_SAVED_SETTINGS[band].ADC_PGA;
				CurrentVFO()->DNR = TRX.BANDS_SAVED_SETTINGS[band].DNR;
				CurrentVFO()->AGC = TRX.BANDS_SAVED_SETTINGS[band].AGC;
			}
			LCD_UpdateQuery.TopButtons = true;
			LCD_UpdateQuery.FreqInfo = true;
		}

		PERIPH_FrontPanel.key_ab_prev = PERIPH_FrontPanel.key_ab;
		PERIPH_FrontPanel.key_tune_prev = PERIPH_FrontPanel.key_tune;
		PERIPH_FrontPanel.key_preatt_prev = PERIPH_FrontPanel.key_preatt;
		PERIPH_FrontPanel.key_fast_prev = PERIPH_FrontPanel.key_fast;
		PERIPH_FrontPanel.key_modep_prev = PERIPH_FrontPanel.key_modep;
		PERIPH_FrontPanel.key_moden_prev = PERIPH_FrontPanel.key_moden;
		PERIPH_FrontPanel.key_bandp_prev = PERIPH_FrontPanel.key_bandp;
		PERIPH_FrontPanel.key_bandn_prev = PERIPH_FrontPanel.key_bandn;
	}

	if (FRONTPanel_MCP3008_2_Enabled)
	{
		//MCP3008 - 2 (10bit - 1024values)
		mcp3008_value = PERIPH_ReadMCP3008_Value(0, AD2_CS_GPIO_Port, AD2_CS_Pin); // MENU
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_menu = true;
		else
			PERIPH_FrontPanel.key_menu = false;

		mcp3008_value = PERIPH_ReadMCP3008_Value(1, AD2_CS_GPIO_Port, AD2_CS_Pin); // CLAR
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_clar = true;
		else
			PERIPH_FrontPanel.key_clar = false;

		mcp3008_value = PERIPH_ReadMCP3008_Value(2, AD2_CS_GPIO_Port, AD2_CS_Pin); // NOTCH
		if (mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_notch = true;
		else
			PERIPH_FrontPanel.key_notch = false;

